# SetWSCellOutlineBorder

## Description
Outlines the specified worksheet cells with the specified border.

SetWSCellOutlineBorder allows borders to be set for a rectangular range of cells. To set the border formatting of a single cell, specify identical values for the top/bottom and left/right range boundaries.

Note:
A rectangular range of cells is formatted as a single block of cells. If you apply a top border to the range of cells, the border is displayed only on the right edge of the cells.

```pascal
PROCEDURE SetWSCellOutlineBorder(
				worksheet   : HANDLE;
				topRow      : INTEGER;
				leftColumn  : INTEGER;
				bottomRow   : INTEGER;
				rightColumn : INTEGER;
				style       : INTEGER;
				weight      : INTEGER;
				color       : LONGINT);
```

```python
def vs.SetWSCellOutlineBorder(worksheet, topRow, leftColumn, bottomRow, rightColumn, style, weight, color):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|worksheet|HANDLE|Worksheet on which function is to operate.|
|topRow|INTEGER|Top row of range to set.|
|leftColumn|INTEGER|Left column of range to set.|
|bottomRow|INTEGER|Bottom row of range to set.|
|rightColumn|INTEGER|Right column of range to set.|
|style|INTEGER|Border line style to be set.(0 = None; 2 = Solid, -1..-32 (dash style index) = Dash)|
|weight|INTEGER|Border line weight to be set.(in Mils)|
|color|LONGINT|Border line color to be set. (color index: 0..255)|

## Examples
```pascal
SetWSCellOutlineBorder(worksheet, 1, 2, 3, 10, 5, 1, 2);
```
```python
import vs

# Outlines the specified worksheet cells with the specified border.
worksheet = vs.GetObject('MyWorksheet')  # handle to a worksheet
topRow = 10
leftColumn = 5
bottomRow = 10
rightColumn = 5
style = 0
weight = 1
color = 5

vs.SetWSCellOutlineBorder(worksheet, topRow, leftColumn, bottomRow, rightColumn, style, weight, color)
```

## Version
Availability: from VectorWorks12.5

## Category
* Worksheets